## Pandas
1. Create DataFrame
2. rename
    - .add_prefix('_suffix_')
3. groupby
4. merge
5. join

## Create DataFrame

In [66]:
import pandas as pd
import numpy as np
df1 = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})
df2 = pd.DataFrame(np.array([[1, 4], [2, 5], [3, 6]]), columns=['A','B'])
df3 = pd.DataFrame(np.array([[1, 4, 8], [1, 5, 9], [2, 6, 10], [2, 7, 11]]), columns=['A','B','D'])

## rename

In [14]:
df1.rename(columns={"A": "a", "B": "c"})

   a  c
0  1  4
1  2  5
2  3  6

In [81]:
df1.columns = ['a','b']
df1

   a  b
0  1  4
1  2  5
2  3  6

In [15]:
df1.rename(str.lower, axis='columns')

   a  b
0  1  4
1  2  5
2  3  6

In [82]:
df1.rename({1: 2, 2: 4}, axis='index')

   a  b
0  1  4
2  2  5
4  3  6

In [84]:
# 添加前綴描述
df1.add_prefix('_suffix_')

   _suffix_a  _suffix_b
0          1          4
1          2          5
2          3          6

## groupby

In [67]:
print(df3)
g = df3.groupby(by=['A'],as_index=True, sort=True,group_keys=True, squeeze=False)

   A  B   D
0  1  4   8
1  1  5   9
2  2  6  10
3  2  7  11

In [68]:
# One-function:max, min, mean, count...
g.max()

   B   D
A
1  5   9
2  7  11

In [69]:
# Multi-function: groupby.agg()
g.agg({'D':['max','min','mean','count']})

    D
  max min  mean count
A
1   9   8   8.5     2
2  11  10  10.5     2

## merge
##### The function to join by key

In [70]:
print(df2)
print(df3)

   A  B
0  1  4
1  2  5
2  3  6
   A  B   D
0  1  4   8
1  1  5   9
2  2  6  10
3  2  7  11

In [71]:
df2.merge(df3,how='left', left_on='A', right_on='A',suffixes=('','_region'))

   A  B  B_region     D
0  1  4       4.0   8.0
1  1  4       5.0   9.0
2  2  5       6.0  10.0
3  2  5       7.0  11.0
4  3  6       NaN   NaN

## join
##### The function to join by index

In [77]:
print(df2)
print(df3)
df3.join(df2, how='left',rsuffix='_join')

   A  B
0  1  4
1  2  5
2  3  6
   A  B   D
0  1  4   8
1  1  5   9
2  2  6  10
3  2  7  11

   A  B   D  A_join  B_join
0  1  4   8     1.0     4.0
1  1  5   9     2.0     5.0
2  2  6  10     3.0     6.0
3  2  7  11     NaN     NaN

In [79]:
df2.join(df3, how='left',rsuffix='_join')

   A  B  A_join  B_join   D
0  1  4       1       4   8
1  2  5       1       5   9
2  3  6       2       6  10